
s" http://goodinfo.tw/StockInfo/ShowSaleMonChart.asp?STOCK_ID="      constant 每月營收
s" http://goodinfo.tw/StockInfo/StockDividendSchedule.asp?STOCK_ID=" constant 除權息日程
s" http://goodinfo.tw/StockInfo/BasicInfo.asp?STOCK_ID="             constant 基本資料
s" http://goodinfo.tw/StockInfo/StockDividendPolicy.asp?STOCK_ID="   constant 股利政策

\ 台灣證券交易所 , 臺灣50指數成分股票
\ http://www.twse.com.tw/ch/trading/indices/twco/tai50i.php
<js>
    var list =  [ 
        ["2330","台積電"], ["2317","鴻海"], ["2412","中華電"], ["1301","台塑"], ["1326","台化"], ["2454","聯發科"], ["1303","南亞"], ["2308","台達電"], ["1216","統一"], ["3008","大立光"], ["2891","中信金"], ["2882","國泰金"], ["2881","富邦金"], ["2886","兆豐金"], ["2002","中鋼"],
        ["2311","日月光"], ["2357","華碩"], ["3045","台灣大"], ["2474","可成"], ["2382","廣達"], ["2892","第一金"], ["2303","聯電"], ["2912","統一超"], ["2884","玉山金"], ["4938","和碩"], ["2207","和泰車"], ["4904","遠傳"], ["6505","台塑化"], ["2105","正新"], ["2880","華南金"], ["2885","元大金"], ["9904","寶成"], ["5880","合庫金"], ["2883","開發金"], ["2325","矽品"], ["1101","台泥"], ["2887","台新金"],
        ["1402","遠東新"], ["2409","友達"], ["2301","光寶科"], ["3481","群創"], ["2890","永豐金"], ["2801","彰銀"], ["2324","仁寶"], ["2395","研華"], ["2354","鴻準"], ["1102","亞泥"], ["1476","儒鴻"], ["3474","華亞科"], ["2408","南科"]
    ]; list 
</jsV> constant 台灣50成分股 // ( -- array ) Array of stocks

\ 股價50元以上殖利率由高到低
<js>
    var list = [
        ["2542","興富發"], ["2548","華固"], ["3623","富晶通"], ["3299","帛漢"], ["6214","精誠"], ["4987","科誠"], ["2404","漢唐"], ["8066","來思達"], ["1582","信錦"], ["3558","神準"], ["3556","禾瑞亞"], ["4977","眾達-KY"], ["3034","聯詠"], ["1599","宏佳騰"], ["4958","臻鼎-KY"], ["8081","致新"], ["4153","鈺緯"], ["3679","新至陞"],
        ["8942","森鉅"], ["8086","宏捷科"], ["3501","維熹"], ["5536","聖暉"], ["6224","聚鼎"], ["4938","和碩"], ["9943","好樂迪"], ["5490","同亨"], ["8070","長華"], ["5264","鎧勝-KY"], ["4912","聯德-KY"], ["1560","中砂"], ["2451","創見"], ["3356","奇偶"], ["3234","光環"], ["2640","大車隊"], ["1580","新麥"], ["3388","崇越電"], ["3570","大塚"], ["8109","博大"], ["5474","聰泰"],
        ["3088","艾訊"], ["6451","訊芯-KY"], ["3491","昇達科"], ["6202","盛群"], ["1477","聚陽"], ["2732","六角"], ["6281","全國電"], ["1558","伸興"], ["6422","君耀-KY"], ["9941","裕融"], ["2227","裕日車"], ["2382","廣達"], ["1232","大統益"], ["1521","大億"], ["6121","新普"], ["5434","崇越"], ["2114","鑫永銓"], ["6277","宏正"], ["2317","鴻海"], ["9930","中聯資源"], ["6269","台郡"],
        ["5871","中租-KY"], ["2377","微星"], ["8050","廣積"], ["2383","台光電"], ["2393","億光"], ["3454","晶睿"], ["9924","福興"], ["6271","同欣電"]
    ]; list
</jsV> constant 股價50元以上殖利率由高到低 // ( -- array ) Array of stocks

台灣50成分股 value stock-list // ( -- array ) Array of stocks

: stock-evaluate ( "stockID" "stockName" --  ) \ 評估這支股票, 寫筆記
   over 每月營收   swap + js: window.open(pop()) 2000 nap
   over 除權息日程 swap + js: window.open(pop()) 2000 nap
   over 基本資料   swap + js: window.open(pop()) 2000 nap
   over 股利政策   swap + js: window.open(pop())
   ( stockID stockName ) + s" 2016 Stock Evaluate " swap +
   <o> <textarea></textarea></o> :: innerText=pop() ;
   /// 用 jeforth.3ce 執行
   /// 自動打開與這支股票相關的網頁以供評估。
   /// 自動打開一個 textarea 寫筆記。

0 value stock-index // ( -- n ) Pointer to stock-list[] array

: N ( -- ) \ Evaluate next stock of stock-list[stock-index]
    stock-index stock-list :> [pop()] dup :> [0] swap :> [1] stock-evaluate
    stock-index 1+ to stock-index ;

